{
  "Pepper_bell_healthy": {
      "pesticide": "None required",
      "solution": "Maintain good soil fertility and regular monitoring.",
      "symptoms": "Healthy bell pepper plants with no signs of disease."
  },
  "Potato_Early_blight": {
      "pesticide": "Fungicides containing Mancozeb or Chlorothalonil",
      "solution": "Practice crop rotation, remove infected debris, and use resistant potato varieties.",
      "symptoms": "Dark brown spots on leaves with concentric rings, yellowing and leaf drop."
  },
  "Potato_healthy": {
      "pesticide": "None required",
      "solution": "Maintain good irrigation and healthy soil conditions.",
      "symptoms": "Healthy potato plants with no visible issues."
  },
  "Potato_Late_blight": {
      "pesticide": "Fungicides containing Copper or Chlorothalonil",
      "solution": "Remove infected plants, avoid overhead irrigation, and ensure good ventilation.",
      "symptoms": "Water-soaked lesions on leaves, dark blight spots, and plant wilting."
  },
  "Tomato_Bacterial_spot": {
      "pesticide": "Copper-based bactericides",
      "solution": "Use disease-free seeds, avoid overhead watering, and apply copper sprays.",
      "symptoms": "Small, dark spots on leaves and fruits, surrounded by yellow halos."
  },
  "Tomato_Early_blight": {
      "pesticide": "Fungicides containing Mancozeb or Chlorothalonil",
      "solution": "Crop rotation, remove infected plant debris, and use resistant tomato varieties.",
      "symptoms": "Concentric rings on leaves, premature leaf drop, and reduced fruit yield."
  },
  "Tomato_healthy": {
      "pesticide": "None required",
      "solution": "Ensure optimal growing conditions and regular monitoring.",
      "symptoms": "Healthy tomato plants with no signs of disease."
  },
  "Tomato_Late_blight": {
      "pesticide": "Fungicides containing Copper or Chlorothalonil",
      "solution": "Remove infected leaves, improve air circulation, and avoid wet foliage.",
      "symptoms": "Grayish, water-soaked lesions on leaves and stems, followed by fruit rot."
  },
  "Tomato_Leaf_Mold": {
      "pesticide": "Fungicides containing Copper or Mancozeb",
      "solution": "Ensure good ventilation, remove infected leaves, and avoid high humidity.",
      "symptoms": "Yellow spots on upper leaf surfaces and a grayish-purple mold on undersides."
  },
  "Tomato_mosaic_virus": {
      "pesticide": "None (virus management only)",
      "solution": "Remove infected plants, disinfect tools, and use resistant varieties.",
      "symptoms": "Mosaic-like patterns on leaves, stunted growth, and distorted fruits."
  },
  "Tomato_Septoria_leaf_spot": {
      "pesticide": "Fungicides containing Mancozeb or Chlorothalonil",
      "solution": "Remove infected leaves, improve air circulation, and apply fungicides as needed.",
      "symptoms": "Small, circular spots with dark borders and gray centers on leaves."
  },
  "Tomato_Spider_mites_Two_spotted_spider_mite": {
      "pesticide": "Miticides such as Abamectin or Neem oil",
      "solution": "Introduce natural predators like ladybugs, and regularly spray neem oil.",
      "symptoms": "Fine webbing on plants, yellowing leaves, and leaf drop."
  },
  "Tomato_Target_Spot": {
      "pesticide": "Fungicides containing Azoxystrobin or Chlorothalonil",
      "solution": "Remove infected debris, improve soil drainage, and apply fungicides.",
      "symptoms": "Brown lesions on leaves with concentric rings, and fruit rot."
  },
  "Tomato_YellowLeaf__Curl_Virus": {
      "pesticide": "None (virus management only)",
      "solution": "Use resistant varieties, control whitefly populations, and remove infected plants.",
      "symptoms": "Yellowing and curling of leaves, stunted growth, and reduced fruit production."
  }
}